Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM2532LS60048.PIC
      <edc:DCRDef edc:_addr="0x804020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USER_WORD_8" edc:default="0xE87673B6" edc:factorydefault="0xE87673B6" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_USERCRC" edc:desc="CRC for USER[1,2,3] DWORDS" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector atdf:pagesize="0x40" edc:beginaddr="0x804024" edc:endaddr="0x804100" edc:erasepagesize="0x100" edc:regionid="userid"/>
    <edc:ConfigFuseSector atdf:pagesize="0x40" edc:beginaddr="0x80C000" edc:endaddr="0x80C100" edc:erasepagesize="0x100" edc:regionid="BOCOR_FUSES">
      <edc:DCRDef edc:_addr="0x80C000" edc:access="----nnnnnnnnn-------------------" edc:cname="BOCOR_WORD_0" edc:default="0xF007FFFF" edc:factorydefault="0xF007FFFF" edc:impl="0xFF80000" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:DCRFieldDef edc:cname="IDAU_BNSC" edc:desc="Boot Non-Secure Callable" edc:nzwidth="0x9"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C004" edc:access="------nn---nnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_1" edc:default="0xFFE80000" edc:factorydefault="0xFFE80000" edc:impl="0x31FFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOOTOPT" edc:desc="Boot Option" edc:nzwidth="0x8"/>
            <edc:DCRFieldDef edc:cname="IDAU_BOOTPROT" edc:desc="Boot Protection" edc:nzwidth="0xB"/>
            <edc:DCRFieldDef edc:cname="BOOTROM_SECCFGLOCK" edc:desc="Security Configuration Lock" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOOTROM_DICEEN" edc:desc="DICE Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_BCWEN" edc:desc="Boot Configuration Write Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NVMCTRL_BCREN" edc:desc="Boot Configuration Read Enable" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_2" edc:default="0xC0349ACC" edc:factorydefault="0xC0349ACC" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOCORCRC" edc:desc="CRC for BOCOR0 DWORD" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:_addr="0x80C00C" edc:offset="0x4"/>
      <edc:DCRDef edc:_addr="0x80C010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_4" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CEKEY0_0" edc:desc="Chip Erase Key 0 bits 31:0" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_5" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CEKEY0_1" edc:desc="Chip Erase Key 0 bits 63:32" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C018" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_6" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CEKEY0_2" edc:desc="Chip Erase Key 0 bits 95:64" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C01C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_7" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CEKEY0_3" edc:desc="Chip Erase Key 0 bits 127:96" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x80C020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BOCOR_WORD_8" edc:default="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="FUSES">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_CEKEY1_0" edc:desc="Chip Erase Key 1 bits 31:0" edc:nzwidth="0x20"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
