Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM2532LS60048.PIC
      <edc:AdjustPoint edc:_addr="0x4000000A" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x40000010" edc:access="------------------------nnnnnnnn" edc:cname="INTFLAGAHB" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:desc="FLASH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APBA_" edc:desc="APBA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APBB_" edc:desc="APBB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APBC_" edc:desc="APBC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMCPU_" edc:desc="HSRAMCPU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMDMAC_" edc:desc="HSRAMDMAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMDSU_" edc:desc="HSRAMDSU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BROM_" edc:desc="BROM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000014" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="INTFLAGA" edc:impl="0x3FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000018" edc:access="--------------------------nnnnnn" edc:cname="INTFLAGB" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:desc="IDAU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:desc="HMATRIXHS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:desc="USB" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000001C" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:cname="INTFLAGC" edc:impl="0x3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:desc="TCC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:desc="I2S" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:desc="OPAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:desc="TRAM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000020" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40000034" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="STATUSA" edc:impl="0x3FFF" edc:mclr="00000000000000001100000000000000" edc:nzwidth="0x20" edc:por="00000000000000001100000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000038" edc:access="--------------------------rrrrrr" edc:cname="STATUSB" edc:impl="0x3F" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:desc="IDAU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:desc="HMATRIXHS APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:desc="USB APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000003C" edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:cname="STATUSC" edc:impl="0x3FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:desc="TCC3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:desc="I2S APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:desc="OPAMP APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:desc="TRAM APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
