Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM2532LS60048.PIC
      <edc:SFRDef edc:_addr="0x40002A38" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="PINSTATE" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="PINSTATE0" edc:desc="Pin State of EXTINT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE1" edc:desc="Pin State of EXTINT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE2" edc:desc="Pin State of EXTINT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE3" edc:desc="Pin State of EXTINT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE4" edc:desc="Pin State of EXTINT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE5" edc:desc="Pin State of EXTINT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE6" edc:desc="Pin State of EXTINT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE7" edc:desc="Pin State of EXTINT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE8" edc:desc="Pin State of EXTINT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE9" edc:desc="Pin State of EXTINT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE10" edc:desc="Pin State of EXTINT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE11" edc:desc="Pin State of EXTINT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE12" edc:desc="Pin State of EXTINT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE13" edc:desc="Pin State of EXTINT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE14" edc:desc="Pin State of EXTINT14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PINSTATE15" edc:desc="Pin State of EXTINT15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A3C" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="NSCHK" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Nonsecure Check Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="Non-Maskable External Interrupt Nonsecure Check Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002A40" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="NONSEC" edc:impl="0x8000FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EIC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="EXTINT0" edc:desc="External Interrupt 0 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT1" edc:desc="External Interrupt 1 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="External Interrupt 2 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="External Interrupt 3 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT4" edc:desc="External Interrupt 4 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT5" edc:desc="External Interrupt 5 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT6" edc:desc="External Interrupt 6 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT7" edc:desc="External Interrupt 7 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT8" edc:desc="External Interrupt 8 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT9" edc:desc="External Interrupt 9 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT10" edc:desc="External Interrupt 10 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT11" edc:desc="External Interrupt 11 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT12" edc:desc="External Interrupt 12 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT13" edc:desc="External Interrupt 13 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT14" edc:desc="External Interrupt 14 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTINT15" edc:desc="External Interrupt 15 Nonsecure Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="Non-Maskable Interrupt Nonsecure Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002A44" edc:offset="0x1BC"/>
      <edc:SFRDef edc:_addr="0x40002C00" edc:access="------nn" edc:cname="CTRLA" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C01" edc:access="-------w" edc:cname="CTRLB" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start Measurement" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C02" edc:access="n-------nnnnnnnn" edc:cname="CFGA" edc:impl="0x80FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="REFNUM" edc:desc="Number of Reference Clock Cycles" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DIVREF" edc:desc="Divide Reference Clock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002C04" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40002C08" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Measurement Done Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C09" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Measurement Done Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
